S1Сtest/src/BusinessProcesses/ПредоставлениеГосуслуги/ПредоставлениеГосуслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПредоставлениеГосуслуги</name>
  <task>Task.Задача</task>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаМаршрута</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявлениеНаПредоставлениеГосуслуги</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПредоставлениеГосуслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступленияЗаявления</name>
    <type>
      <types>CatalogRef.КаналыПоступленияЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПредоставленияГосУслуги</name>
    <type>
      <types>DocumentRef.РезультатПредоставленияГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийСрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ЗаявлениеНаПредоставлениеГосуслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПредоставлениеГосуслуги</name>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступленияЗаявления</name>
    <type>
      <types>CatalogRef.КаналыПоступленияЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателя</name>
    <type>
      <types>EnumRef.КатегорияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>Characteristic.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

S1Сtest/src/BusinessProcesses/ПредоставлениеГосуслуги/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПредоставлениеГосуслуги") Тогда
		ЗаявлениеНаПредоставлениеГосуслуги = ДанныеЗаполнения;
		ГосУслуга = ДанныеЗаполнения.ГосУслуга;
		КаналПоступленияЗаявления = ДанныеЗаполнения.КаналПоступленияЗаявления;
		Получатель = ДанныеЗаполнения.Получатель;
		ДатаЗаявления = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
			ДанныеЗаполнения, ПланыВидовХарактеристик.ВидПоляЗаявления.ДатаЗаявления);
	КонецЕсли;
	
	// Устанавливаем карту маршрута
	КартаМаршрута = Новый ХранилищеЗначения(ГосУслуга.КартаМаршрута.Получить());
	
	// Вычисляем ожидаемый срок выполнения
	ЧислоСекундВСутках = 86400;
	ОжидаемыйСрокВыполнения = ДатаЗаявления + ЧислоСекундВСутках * ГосУслуга.СрокВыполнения;
	
	Дата = ТекущаяДата();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
